Repository: urglmorl/openXTranscriber
Catalog: openXTranscriber/Localizable.xcstrings
Source language: en
Languages: ru

source: — helps Whisper with names and jargon
ru: — помогает Whisper'у с именами и терминами

source: — select —
ru: — выбрать —

source: "%@" saved. Run transcription with speaker diarization?
ru: «%@» сохранено. Запустить транскрипцию с диаризацией спикеров?

source: %lld blocks
ru: блоков: %lld

source: %lld of %lld accepted
ru: Принято: %lld из %lld

source: %lld sample(s) • updated %@
ru: Образцов: %lld • обновлён %@

source: %lld speaker(s) need a name
ru: Без имени спикеров: %lld

source: ● Recording %@
ru: ● Идёт запись %@

source: A one-time setup to enable speaker diarization.
ru: Один раз настройте, чтобы включить диаризацию спикеров.

source: Above auto-label threshold the speaker is renamed silently. Between thresholds it is shown for confirmation. Below it stays as SPEAKER_XX.
ru: Выше порога авто-подписи спикер переименовывается без подтверждения. Между порогами — показывается на подтверждение. Ниже — остаётся как SPEAKER_XX.

source: Accept model agreements
ru: Примите соглашения моделей

source: Access granted
ru: Доступ есть

source: Add access token
ru: Добавьте access token

source: Add to library
ru: Добавить в библиотеку

source: Add your access token first — we use it to check which agreements are already accepted.
ru: Сначала добавьте access token — без него не проверить, какие соглашения уже приняты.

source: Agreement not accepted yet
ru: Соглашение пока не принято

source: All accepted
ru: Все приняты

source: Allow Screen Recording
ru: Разрешить запись экрана

source: Audio Extraction
ru: Извлечение аудио

source: Auto-include voice library names in prompt
ru: Подставлять имена из библиотеки голосов в промпт

source: Auto-label threshold
ru: Порог авто-подписи

source: Auto-labeled — %@ of speech
ru: Автоопознан — %@ речи

source: Auto-labeled %lld speaker(s) from voice library.
ru: Автоматически опознано спикеров из библиотеки: %lld.

source: Available: %@
ru: Доступно: %@

source: Cancel
ru: Отмена

source: Cancel (discard)
ru: Отменить (отбросить)

source: Change Output Folder…
ru: Сменить папку для записей…

source: Check Runtime
ru: Проверить runtime

source: Checking
ru: Проверка

source: Checking runtime...
ru: Проверка runtime...

source: Checking…
ru: Проверяем…

source: Choose File
ru: Выбрать файл

source: Choose Folder
ru: Выбрать папку

source: Choose Source…
ru: Выбрать источник…

source: Choose what to record
ru: Выберите, что записывать

source: Clear history
ru: Очистить историю

source: Complete onboarding once. Then you can process files with full speaker diarization.
ru: Пройдите онбординг один раз — после этого можно будет обрабатывать файлы с диаризацией спикеров.

source: Confirm matches or add new voices to your library.
ru: Подтвердите совпадения или добавьте новые голоса в библиотеку.

source: Confirm matches or add new voices to your library. The transcript will be updated automatically.
ru: Подтвердите совпадения или добавьте новые голоса в библиотеку. Транскрипт обновится автоматически.

source: Context (optional)
ru: Контекст (необязательно)

source: Continue without diarization
ru: Продолжить без диаризации

source: Could not reach Hugging Face: %@
ru: Не удалось связаться с Hugging Face: %@

source: Create new token
ru: Создать новый токен

source: Delete failed: %@
ru: Удаление не удалось: %@

source: Dependency Check
ru: Проверка зависимостей

source: Diarization
ru: Диаризация

source: Dismiss
ru: Закрыть

# Display %u — %lld×%lld
source: Display %1$u — %2$lld×%3$lld
ru: Дисплей %1$u — %2$lld×%3$lld

source: Done
ru: Готово

source: Drop audio or video file here
ru: Перетащите сюда аудио или видеофайл

source: Enable voice fingerprinting
ru: Включить распознавание голосов

source: Erase library
ru: Очистить библиотеку

source: Existing voice:
ru: Существующий голос:

source: Failed
ru: Ошибка

source: File missing
ru: Файл отсутствует

source: File: %@
ru: Файл: %@

source: Finish
ru: Готово

source: Finished
ru: Завершено

source: Fixed folder
ru: Фиксированная папка

source: Folder
ru: Папка

source: Follow the steps and verify your token to unlock speaker diarization.
ru: Пройдите шаги и проверьте токен, чтобы разблокировать диаризацию спикеров.

source: Free account. Diarization models are downloaded from there.
ru: Бесплатный аккаунт. Оттуда скачиваются модели диаризации.

source: Frontmost window — %@
ru: Активное окно — %@

source: Generate a Read-only token. We store it in macOS Keychain — never on disk in plain text.
ru: Создайте токен с правом «Read». Храним его в Keychain macOS, не в открытом виде.

source: hf_… token
ru: Токен hf_…

source: History
ru: История

source: Home
ru: Главная

source: HuggingFace Token
ru: Токен HuggingFace

source: HuggingFace token is missing. Open Settings and add it.
ru: Не задан HuggingFace токен. Откройте настройки и добавьте его.

source: Idle
ru: Простой

source: Install Managed Runtime
ru: Установить managed runtime

source: Installing
ru: Установка

source: Installing managed runtime...
ru: Установка managed runtime...

source: Interface
ru: Интерфейс

source: Interface language
ru: Язык интерфейса

source: Language
ru: Язык

source: Library
ru: Медиатека

source: Library is empty. Names will be added after the first meeting you confirm.
ru: Библиотека пуста. Имена появятся после первой встречи, которую вы подтвердите.

source: Loading…
ru: Загрузка…

source: Manage manually in System Settings → General → Login Items.
ru: Можно изменить вручную в Настройках → Основные → Объекты входа.

source: Managed runtime installed. You can verify your token now.
ru: Managed runtime установлен. Теперь можно проверить токен.

source: Managed runtime ready: %@
ru: Managed runtime готов: %@

source: Managed runtime will be prepared in Application Support and used for all Python calls.
ru: Managed runtime будет подготовлен в Application Support и использован для всех Python-вызовов.

source: Meeting topic, names, jargon...
ru: Тема созвона, имена, термины…

source: Mode: %@
ru: Режим: %@

source: Name
ru: Имя

source: Name speakers
ru: Назвать спикеров

source: Names of saved voices are added to the Whisper prompt before each run, so spellings of recurring participants stay consistent.
ru: Имена сохранённых голосов добавляются в промпт перед каждым прогоном, чтобы написание повторяющихся участников оставалось единообразным.

source: Names will be added here after you confirm speakers from your first transcripts.
ru: Имена появятся здесь после того, как вы подтвердите спикеров в первых транскриптах.

source: Needs attention
ru: Требует внимания

source: New name (e.g. Alex)
ru: Новое имя (например, Алекс)

source: Next to source file
ru: Рядом с исходным файлом

source: No available runtime. Install managed runtime or provide python path.
ru: Нет доступного runtime. Установите managed runtime или укажите путь к Python.

source: No display available to record.
ru: Нет доступного дисплея для записи.

source: No displays or windows available
ru: Нет доступных дисплеев или окон

source: No folder selected
ru: Папка не выбрана

source: No history yet
ru: Истории пока нет

source: No Python runtime found. Install managed runtime or configure a custom Python path in Settings.
ru: Не найден Python runtime. Установите managed runtime или укажите путь к Python в настройках.

source: No speakers left to name.
ru: Все спикеры названы.

source: No voices yet
ru: Голосов пока нет

source: Noise Gate (silence background when quiet)
ru: Шумовой гейт (приглушать фон в тишине)

source: Not selected
ru: Не выбран

source: Onboarding
ru: Онбординг

source: Onboarding is completed.
ru: Онбординг завершён.

source: Onboarding will be shown at startup.
ru: Онбординг будет показан при запуске.

source: Open
ru: Открыть

source: Open at login
ru: Запускать при входе в систему

source: Open each model page and click “Access repository” / accept terms:
ru: Откройте страницу каждой модели и нажмите “Access repository” / примите условия:

source: Open file
ru: Открыть файл

source: Open File
ru: Открыть файл

source: Open Hugging Face
ru: Открыть Hugging Face

source: Open login / register page
ru: Открыть страницу входа / регистрации

source: Open recordings folder
ru: Открыть папку с записями

source: Open Recordings Folder
ru: Открыть папку с записями

source: Open System Settings…
ru: Открыть Системные настройки…

source: Open token settings page
ru: Открыть страницу настроек токенов

source: openXTranscriber needs microphone access to record a voice-over track. Enable it under Privacy & Security › Microphone, then click Record again.
ru: openXTranscriber нужен доступ к микрофону для записи голосовой дорожки. Включите его в «Конфиденциальность и безопасность › Микрофон» и нажмите «Запись» снова.

source: openXTranscriber needs Screen Recording access. Enable it under Privacy & Security › Screen Recording, then quit and reopen the app.
ru: openXTranscriber нужен доступ к записи экрана. Включите его в «Конфиденциальность и безопасность › Запись экрана», затем закройте и снова откройте приложение.

source: Operation cancelled.
ru: Операция отменена.

source: Other displays
ru: Другие дисплеи

source: Output
ru: Сохранение результата

source: Output: %@
ru: Вывод: %@

source: Paste HF token (hf_...)
ru: Вставьте HF токен (hf_...)

source: Permission required
ru: Нужно разрешение

source: Pick
ru: Выбрать

source: Play sample
ru: Воспроизвести

source: Possible participants:
ru: Возможные участники:

source: Probable match — %@ of speech
ru: Возможное совпадение — %@ речи

source: Process Another
ru: Обработать ещё файл

source: Processing
ru: Обработка

source: Processing completed
ru: Обработка завершена

source: Python path
ru: Путь к Python

source: Quit openXTranscriber
ru: Выйти из openXTranscriber

source: Readiness check failed: %@
ru: Проверка готовности не удалась: %@

source: Readiness has not been checked yet.
ru: Готовность ещё не проверена.

source: Readiness: %@
ru: Готовность: %@

source: Ready
ru: Готов

source: Recheck
ru: Проверить ещё раз

source: Record
ru: Запись

source: Record Frontmost Window — %@
ru: Записать активное окно — %@

# Record Main Display (%lld×%lld)
source: Record Main Display (%1$lld×%2$lld)
ru: Записать основной дисплей (%1$lld×%2$lld)

source: Recording error
ru: Ошибка записи

source: Recording finished
ru: Запись завершена

source: Recording Settings
ru: Настройки записи

source: Refresh
ru: Обновить

source: Refresh sources
ru: Обновить источники

source: Refresh Sources
ru: Обновить источники

source: Reinstall Runtime
ru: Переустановить runtime

source: Reload
ru: Перезагрузить

source: Rename
ru: Переименовать

source: Rename failed: %@
ru: Переименование не удалось: %@

source: Reset to ~/Movies/openXTranscriber
ru: Сбросить на ~/Movies/openXTranscriber

source: Restart the app to apply the interface language change.
ru: Перезапустите приложение, чтобы применить смену языка интерфейса.

source: Result
ru: Результат

source: Result Generation
ru: Формирование результата

source: Reveal in Finder
ru: Показать в Finder

source: Runtime available: %@
ru: Runtime доступен: %@

source: Runtime has not been checked yet.
ru: Runtime ещё не проверен.

source: Runtime install failed: %@
ru: Установка runtime не удалась: %@

source: Runtime status unknown.
ru: Состояние runtime неизвестно.

source: Save
ru: Сохранить

source: Save failed: %@
ru: Сохранение не удалось: %@

source: Save mode
ru: Режим сохранения

source: Save Token
ru: Сохранить токен

source: Saved
ru: Сохранено

source: Saved blocks: %lld
ru: Сохранено блоков: %lld

source: Saving Result
ru: Сохранение результата

source: Screen Recording permission is required. Grant it in System Settings, then try again.
ru: Нужно разрешение на запись экрана. Выдайте его в Системных настройках и повторите.

source: Screen Recording permission required
ru: Нужно разрешение на запись экрана

source: Screen Recording required
ru: Нужна запись экрана

source: Script %@ is missing. Please ensure it exists in Scripts.
ru: Скрипт %@ не найден. Убедитесь, что он есть в папке Scripts.

source: Script %@ returned invalid data.
ru: Скрипт %@ вернул некорректные данные.

source: Select
ru: Выбрать

source: Select Python executable
ru: Выберите исполняемый файл Python

source: Selected interpreter: %@
ru: Выбранный интерпретатор: %@

source: Selected: %@
ru: Выбрано: %@

source: Settings
ru: Настройки

source: Show details
ru: Показать детали

source: Show in Finder
ru: Показать в Finder

source: Show onboarding again
ru: Показать онбординг снова

source: Show openXTranscriber
ru: Показать openXTranscriber

source: Sign in to Hugging Face
ru: Войдите в Hugging Face

source: Signed in
ru: Вход выполнен

source: Skip
ru: Пропустить

source: Skip remaining
ru: Пропустить остальные

source: Stage: %@
ru: Этап: %@

source: Start Processing
ru: Начать обработку

source: Startup
ru: Автозапуск

source: State: %@
ru: Состояние: %@

source: Status
ru: Состояние

source: Step 1. Create or sign in to Hugging Face
ru: Шаг 1. Создайте аккаунт или войдите в Hugging Face

source: Step 2. Accept required model agreements
ru: Шаг 2. Примите соглашения для нужных моделей

source: Step 3. Create and paste an access token
ru: Шаг 3. Создайте и вставьте access token

source: Stop
ru: Остановить

source: Stop · %@
ru: Остановить · %@

source: Stop recording
ru: Остановить запись

source: Stop Recording
ru: Остановить запись

source: Suggest-only threshold
ru: Порог предложения

source: Suggested match: %@ (cosine %@)
ru: Возможное совпадение: %@ (косинус %@)

source: Supported: webm, mov, mp4, m4a, wav, mp3, ogg, flac, mkv, aac
ru: Поддерживается: webm, mov, mp4, m4a, wav, mp3, ogg, flac, mkv, aac

source: System
ru: Системный

source: The capture source ended. The partial recording was saved.
ru: Источник захвата прекратил работу. Частичная запись сохранена.

# This screen — Display %u (%lld×%lld)
source: This screen — Display %1$u (%2$lld×%3$lld)
ru: Этот экран — дисплей %1$u (%2$lld×%3$lld)

source: Three pyannote models. Each needs a one-time agreement on Hugging Face. Click "Open" → press the green "Agree and access repository" button → come back here.
ru: Три модели pyannote. Для каждой нужно один раз принять соглашение на Hugging Face. Нажмите «Открыть» → на странице нажмите зелёную кнопку «Agree and access repository» → возвращайтесь.

source: Token
ru: Токен

source: Token is empty. Paste your Hugging Face token first.
ru: Токен пуст. Сначала вставьте свой Hugging Face токен.

source: Token rejected. Make sure you copied the full string.
ru: Токен не принят. Проверьте, что скопировали его целиком.

source: Token verified
ru: Токен проверен

source: Token verified. Onboarding complete.
ru: Токен проверен. Онбординг завершён.

source: Transcribe with diarization
ru: Транскрибировать с диаризацией

source: Transcription
ru: Транскрипция

source: Transcription + diarization
ru: Транскрипция + диаризация

source: Transcription language
ru: Язык транскрипции

source: Transcription only
ru: Только транскрипция

source: Unknown access error.
ru: Неизвестная ошибка доступа.

source: Unknown speaker — %@ of speech
ru: Неизвестный спикер — %@ речи

source: Unsupported input file format.
ru: Неподдерживаемый формат входного файла.

source: Untitled
ru: Без названия

source: Use
ru: Применить

source: Verification failed: %@
ru: Проверка не удалась: %@

source: Verify
ru: Проверить

source: Verify Token and Finish
ru: Проверить токен и завершить

source: Verifying token and model access...
ru: Проверка токена и доступа к моделям...

source: Verifying…
ru: Проверяем…

source: Voice Library
ru: Библиотека голосов

source: Voice Matching
ru: Сопоставление голосов

source: Voices
ru: Голоса

source: Welcome to openXTranscriber
ru: Добро пожаловать в openXTranscriber

source: Whisper model
ru: Модель Whisper

source: Window
ru: Окно

source: Your processed transcripts will appear here, sorted by date.
ru: Здесь будут появляться обработанные транскрипты, отсортированные по дате.
